In [9]:
import pandas as pd

In [10]:
df_big = pd.read_csv('DataSets/Copy of BigmacBurger_data2.csv',parse_dates=['Date'],index_col=['Date','Country'])
df_big.head()

                  Price in US Dollars
Date   Country
Jan-16 Argentina                 2.39
       Australia                 3.74
       Brazil                    3.35
       Britain                   4.22
       Canada                    4.14

In [33]:
df_big.loc[('Jan-16')].loc["Australia":'Canada']

           Price in US Dollars
Country
Australia                 3.74
Brazil                    3.35
Britain                   4.22
Canada                    4.14

In [47]:
df_big.loc[('Jan-16')]["Australia":'Canada']

           Price in US Dollars
Country
Australia                 3.74
Brazil                    3.35
Britain                   4.22
Canada                    4.14

In [25]:
df_big.rename(index={'Date':'Country'})#,'Country':'Date'})

                      Price in US Dollars
Date   Country
Jan-16 Argentina                     2.39
       Australia                     3.74
       Brazil                        3.35
       Britain                       4.22
       Canada                        4.14
...                                   ...
Jan-10 UAE                           2.99
       Ukraine                       1.83
       United States                 3.58
       Uruguay                       3.32
       Urgu                          3.32

[653 rows x 1 columns]

In [51]:
df_big.index.get_level_values(1)

Index(['Argentina', 'Australia', 'Brazil', 'Britain', 'Canada', 'Chile',
       'China', 'Colombia', 'Costa Rica', 'Czech Republic',
       ...
       'Sweden', 'Switzerland', 'Taiwan', 'Thailand', 'Turkey', 'UAE',
       'Ukraine', 'United States', 'Uruguay', 'Urgu'],
      dtype='object', name='Country', length=653)

In [58]:
df_big.transpose().loc[:,'Jan-16'].loc[:,'Argentina':'Canada']

Country              Argentina  Australia  Brazil  Britain  Canada
Price in US Dollars       2.39       3.74    3.35     4.22    4.14

In [68]:
df_big_tr=df_big.transpose()
df_big_tr.loc['Country':,'Jan-16']

Country,Argentina,Australia,Brazil,Britain,Canada,Chile,China,Colombia,Costa Rica,Czech Republic,...,Estonia,Finland,France,Germany,Greece,Ireland,Italy,Netherlands,Portugal,Spain
Price in US Dollars,2.39,3.74,3.35,4.22,4.14,2.94,2.68,2.43,4.02,2.98,...,3.23,4.41,4.41,3.86,3.6,4.25,4.3,3.71,3.23,3.76

In [81]:
df_big_tr['Jan-16'].loc[:,'Australia':'Canada']
# df_big_tr.loc[:,('Jan-16','Argentina'):('Jan-16','Chile')]

Country              Australia  Brazil  Britain  Canada
Price in US Dollars       3.74    3.35     4.22    4.14

In [73]:
df_big_tr.columns

MultiIndex([('Jan-16',      'Argentina'),
            ('Jan-16',      'Australia'),
            ('Jan-16',         'Brazil'),
            ('Jan-16',        'Britain'),
            ('Jan-16',         'Canada'),
            ('Jan-16',          'Chile'),
            ('Jan-16',          'China'),
            ('Jan-16',       'Colombia'),
            ('Jan-16',     'Costa Rica'),
            ('Jan-16', 'Czech Republic'),
            ...
            ('Jan-10',         'Sweden'),
            ('Jan-10',    'Switzerland'),
            ('Jan-10',         'Taiwan'),
            ('Jan-10',       'Thailand'),
            ('Jan-10',         'Turkey'),
            ('Jan-10',            'UAE'),
            ('Jan-10',        'Ukraine'),
            ('Jan-10',  'United States'),
            ('Jan-10',        'Uruguay'),
            ('Jan-10',           'Urgu')],
           names=['Date', 'Country'], length=653)

In [82]:
df_big = pd.read_csv('DataSets/Copy of BigmacBurger_data2.csv',parse_dates=['Date'],index_col=['Date'])
df_big.head()

          Country  Price in US Dollars
Date
Jan-16  Argentina                 2.39
Jan-16  Australia                 3.74
Jan-16     Brazil                 3.35
Jan-16    Britain                 4.22
Jan-16     Canada                 4.14

In [84]:
df_big.index

Index(['Jan-16', 'Jan-16', 'Jan-16', 'Jan-16', 'Jan-16', 'Jan-16', 'Jan-16',
       'Jan-16', 'Jan-16', 'Jan-16',
       ...
       'Jan-10', 'Jan-10', 'Jan-10', 'Jan-10', 'Jan-10', 'Jan-10', 'Jan-10',
       'Jan-10', 'Jan-10', 'Jan-10'],
      dtype='object', name='Date', length=653)

In [96]:
# df_big.loc['Jan-16'].stack()
df_big.stack()

Date
Jan-16  Country                Argentina
        Price in US Dollars         2.39
        Country                Australia
        Price in US Dollars         3.74
        Country                   Brazil
                                 ...
Jan-10  Price in US Dollars         3.58
        Country                  Uruguay
        Price in US Dollars         3.32
        Country                     Urgu
        Price in US Dollars         3.32
Length: 1306, dtype: object

In [95]:
df_big.unstack(level=0)

                     Date
Country              Jan-16    Argentina
                     Jan-16    Australia
                     Jan-16       Brazil
                     Jan-16      Britain
                     Jan-16       Canada
                                 ...
Price in US Dollars  Jan-10         2.99
                     Jan-10         1.83
                     Jan-10         3.58
                     Jan-10         3.32
                     Jan-10         3.32
Length: 1306, dtype: object

In [99]:
df_big.pivot(columns='Country')

        Price in US Dollars                                                  \
Country           Argentina Australia Austria Belgium Brazil Britain Canada
Date
Jan-10                 1.84      3.98     NaN     NaN   4.76    3.67   3.97
Jan-12                 4.64      4.94    3.92    4.69   5.68    3.82   4.63
Jan-13                 3.82      4.90    4.60    5.16   5.64    4.25   5.39
Jan-14                 3.03      4.47    4.60    5.36   5.25    4.63   5.01
Jan-15                 3.25      4.32    3.93    4.29   5.21    4.37   4.64
Jan-16                 2.39      3.74    3.76    4.25   3.35    4.22   4.14
Jul-10                 3.56      3.84     NaN     NaN   4.91    3.48   4.00
Jul-11                 4.84      4.94    4.43    5.38   6.16    3.89   5.00
Jul-12                 4.16      4.68    3.87    4.61   4.94    4.16   5.02
Jul-13                 3.88      4.62    4.36    4.76   5.28    4.02   5.26
Jul-14                 2.57      4.81    4.56    4.98   5.86    4.93   5.25
Jul-15                 3.07      3.92    3.71    4.05   4.28    4.51   4.54

                              ...                                       \
Country Chile China Colombia  ... Taiwan Thailand Turkey   UAE Ukraine
Date                          ...
Jan-10   3.18  1.83     3.91  ...   2.36     2.11   3.83  2.99    1.83
Jan-12   4.05  2.44     4.54  ...   2.50     2.46   3.54  3.27    2.11
Jan-13   4.35  2.57     4.85  ...   2.54     2.92   4.78  3.27    2.33
Jan-14   3.69  2.74     4.34  ...   2.62     2.92   3.76  3.27    2.27
Jan-15   3.35  2.77     3.34  ...   2.51     3.04   3.96  3.54    1.20
Jan-16   2.94  2.68     2.43  ...   2.08     3.09   3.41  3.54    1.54
Jul-10   3.34  1.95     4.39  ...   2.34     2.17   3.89  2.99    1.84
Jul-11   4.00  2.27     4.74  ...   2.60     2.35   3.77  3.27    2.06
Jul-12   4.16  2.45     4.77  ...   2.48     2.59   4.52  3.27    1.86
Jul-13   3.94  2.61     4.48  ...   2.63     2.85   4.34  3.27    2.33
Jul-14   3.72  2.73     4.65  ...   2.63     3.12   4.42  3.54    1.63
Jul-15   3.27  2.74     2.92  ...   2.55     3.17   3.87  3.54    1.55


Country United States  Urgu Uruguay Venezuela Vietnam
Date
Jan-10           3.58  3.32    3.32       NaN     NaN
Jan-12           4.20   NaN    4.63      6.99     NaN
Jan-13           4.37   NaN    5.45      9.08     NaN
Jan-14           4.62   NaN    4.91      7.15    2.84
Jan-15           4.79   NaN    4.63      2.53    2.81
Jan-16           4.93   NaN    3.74      0.66    2.67
Jul-10           3.73   NaN    3.74       NaN     NaN
Jul-11           4.07   NaN    4.88      6.52     NaN
Jul-12           4.33   NaN    4.53      7.92     NaN
Jul-13           4.56   NaN    4.98      7.15     NaN
Jul-14           4.80   NaN    4.92      6.82    2.83
Jul-15           4.79   NaN    4.13      0.67    2.75

[12 rows x 59 columns]

In [112]:
# create pivot using team as col, first name as indx, sal as val

df_emp = pd.read_csv('DataSets/EmployeesInfo.csv')
df_emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [113]:
df_emp = df_emp.drop_duplicates(subset=['First Name'], keep='first')
df_emp =df_emp.dropna()

In [114]:
df_emp.pivot(columns=['Team'],index='First Name',values='Salary')

Team,Business Development,Client Services,Distribution,Engineering,Finance,Human Resources,Legal,Marketing,Product,Sales
First Name,,,,,,,,,,
Aaron,NaN,NaN,NaN,NaN,NaN,NaN,NaN,61602.0,NaN,NaN
Adam,NaN,NaN,95327.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Albert,NaN,NaN,NaN,67827.0,NaN,NaN,NaN,NaN,NaN,NaN
Alice,NaN,NaN,NaN,NaN,51395.0,NaN,NaN,NaN,NaN,NaN
Amanda,NaN,NaN,80803.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
Walter,NaN,NaN,NaN,NaN,127813.0,NaN,NaN,NaN,NaN,NaN
Wanda,NaN,NaN,NaN,NaN,NaN,NaN,65362.0,NaN,NaN,NaN
Wayne,NaN,NaN,102652.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
William,NaN,NaN,NaN,NaN,NaN,66521.0,NaN,NaN,NaN,NaN
Willie,NaN,NaN,NaN,NaN,NaN,NaN,NaN,64363.0,NaN,NaN

In [116]:
df_emp.pivot(columns='First Name',index=['Team'],values='Salary').fillna('')

First Name,Aaron,Adam,Albert,Alice,Amanda,Amy,Andrea,Andrew,Angela,Ann,...,Terry,Theresa,Timothy,Tina,Todd,Walter,Wanda,Wayne,William,Willie
Team,,,,,,,,,,,,,,,,,,,,,
Business Development,,,,,,,120204.0,,,90719.0,...,,,,,,,,,,
Client Services,,,,,,,,43414.0,,,...,124008.0,,,,,,,,,
Distribution,,95327.0,,,80803.0,,,,,,...,,,,,,,,102652.0,,
Engineering,,,67827.0,,,122897.0,,,95570.0,,...,,,,,,,,,,
Finance,,,,51395.0,,,,,,,...,,,,,,127813.0,,,,
Human Resources,,,,,,,,,,,...,,,,,49339.0,,,,66521.0,
Legal,,,,,,,,,,,...,,,49473.0,,,,65362.0,,,
Marketing,61602.0,,,,,,,,,,...,,,,100705.0,,,,,,64363.0
Product,,,,,,,,,,,...,,,,,,,,,,
Sales,,,,,,,,,,,...,,85182.0,,,,,,,,

In [117]:
df_uf = pd.read_csv('DataSets/userfoods.csv')
df_uf.head()

  First Name  Gender          City Frequency       Item  Spend
0      Wanda  Female      Stamford    Weekly     Burger  15.66
1       Eric    Male      Stamford     Daily    Chalupa  10.56
2    Charles    Male      New York     Never      Sushi  42.14
3       Anna  Female  Philadelphia      Once  Ice Cream  11.01
4    Deborah  Female  Philadelphia     Daily    Chalupa  23.49

In [120]:
df_uf.pivot_table(index='City', columns='Frequency', values='Spend',aggfunc=sum)

Frequency,Daily,Monthly,Never,Often,Once,Seldom,Weekly,Yearly
City,,,,,,,,
New York,2595.22,2358.57,1471.69,1938.69,1693.50,1698.49,2257.71,1795.70
Philadelphia,2523.96,1937.61,2763.40,1995.44,2298.81,2257.49,2129.50,1928.33
Stamford,1857.67,1709.39,1903.07,2423.31,1930.01,1529.38,2876.35,2196.08

In [121]:
df_uf.pivot_table(index='Gender',values='Spend', aggfunc=sum)

           Spend
Gender
Female  25963.33
Male    24106.04

In [164]:
df_uf.pivot_table(index=['Item'], values=['Spend','City'],aggfunc=[sum])

               sum
             Spend
Item
Burger     7765.73
Burrito    8270.44
Chalupa    7644.52
Donut      8758.76
Ice Cream  8886.99
Sushi      8742.93

In [156]:
# df_uf.pivot_table(index=['Item','City'], values=['Spend'],aggfunc=[sum])

In [198]:
df_uf.groupby(['Item','City'])['Spend'].sum().transpose()

Item       City
Burger     New York        2533.13
           Philadelphia    2577.42
           Stamford        2655.18
Burrito    New York        2378.35
           Philadelphia    2771.69
           Stamford        3120.40
Chalupa    New York        2104.35
           Philadelphia    2787.56
           Stamford        2752.61
Donut      New York        2792.05
           Philadelphia    2888.62
           Stamford        3078.09
Ice Cream  New York        3125.25
           Philadelphia    3670.49
           Stamford        2091.25
Sushi      New York        2876.44
           Philadelphia    3138.76
           Stamford        2727.73
Name: Spend, dtype: float64

In [188]:
df_fort = pd.read_csv('DataSets/fortune_data.csv')
df_fort.head()

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400

In [199]:
df_fort.groupby('Sector').first()

,Rank,Company,Industry,Location,Revenue,Profits,Employees
Sector,,,,,,,
Aerospace & Defense,24,Boeing,Aerospace and Defense,"Chicago, IL",96114,5176,161400
Apparel,91,Nike,Apparel,"Beaverton, OR",30601,3273,62600
Business Services,144,ManpowerGroup,Temporary Help,"Milwaukee, WI",19330,419,27000
Chemicals,56,Dow Chemical,Chemicals,"Midland, MI",48778,7685,49495
Energy,2,Exxon Mobil,Petroleum Refining,"Irving, TX",246204,16150,75600
Engineering & Construction,155,Fluor,"Engineering, Construction","Irving, TX",18114,413,38758
Financials,4,Berkshire Hathaway,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
Food and Drug Stores,7,CVS Health,Food and Drug Stores,"Woonsocket, RI",153290,5237,199000
"Food, Beverages & Tobacco",41,Archer Daniels Midland,Food Production,"Chicago, IL",67702,1849,32300
Health Care,5,McKesson,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
"Hotels, Resturants & Leisure",109,McDonaldâ€™s,Food Services,"Oak Brook, IL",25413,4529,420000
Household Products,34,Procter & Gamble,Household and Personal Products,"Cincinnati, OH",78756,7036,110000
Industrials,11,General Electric,Industrial Machinery,"Fairfield, CT",140389,-6126,333000
Materials,126,Alcoa,Metals,"New York, NY",22534,-322,60000
Media,53,Disney,Entertainment,"Burbank, CA",52465,8382,185000
Motor Vehicles & Parts,8,General Motors,Motor Vehicles and Parts,"Detroit, MI",152356,9687,215000
Retailing,1,Walmart,General Merchandisers,"Bentonville, AR",482130,14694,2300000
Technology,3,Apple,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
Telecommunications,10,AT&T,Telecommunications,"Dallas, TX",146801,13345,281450
Transportation,48,UPS,"Mail, Package, and Freight Delivery","Atlanta, GA",58363,4844,341240
Wholesalers,57,Sysco,Wholesalers: Food and Grocery,"Houston, TX",48681,687,51700

In [200]:
df_fort.groupby('Sector').last()

,Rank,Company,Industry,Location,Revenue,Profits,Employees
Sector,,,,,,,
Aerospace & Defense,987,Delta Tucker Holdings,Aerospace and Defense,"McLean, VA",1923,-133,12000
Apparel,917,Guess,Apparel,"Los Angeles, CA",2204,82,13500
Business Services,993,DeVry Education Group,Education,"Downers Grove, IL",1910,140,11770
Chemicals,949,H.B. Fuller,Chemicals,"St. Paul, MN",2084,87,4425
Energy,997,Portland General Electric,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
Engineering & Construction,994,MDC Holdings,Homebuilders,"Denver, CO",1909,66,1225
Financials,996,New York Community Bancorp,Commercial Banks,"Westbury, NY",1902,-47,3448
Food and Drug Stores,928,Fredâ€™s,Food and Drug Stores,"Memphis, TN",2151,-7,7103
"Food, Beverages & Tobacco",954,Alliance One International,Tobacco,"Morrisville, NC",2066,-15,6835
Health Care,978,Providence Service,Health Care: Pharmacy and Other Services,"Tucson, AZ",1987,84,9072
"Hotels, Resturants & Leisure",999,Wendyâ€™s,Food Services,"Dublin, OH",1896,161,21200
Household Products,992,Revlon,Household and Personal Products,"New York, NY",1914,56,5700
Industrials,1000,Briggs & Stratton,Industrial Machinery,"Wauwatosa, WI",1895,46,5480
Materials,986,Schnitzer Steel Industries,Metals,"Portland, OR",1924,-197,2955
Media,989,Cenveo,"Publishing, Printing","Stamford, CT",1921,-31,7300
Motor Vehicles & Parts,979,Allison Transmission Holdings,Motor Vehicles and Parts,"Indianaoplis, IN",1986,182,2700
Retailing,973,99 Cents Only Stores,Specialty Retailers: Other,"Commerce, CA",1999,-232,18200
Technology,990,F5 Networks,Network and Other Communications Equipment,"Seattle, WA",1920,365,4178
Telecommunications,786,Equinix,Telecommunications,"Redwood City, CA",2726,188,5042
Transportation,974,Roadrunner Transportation Systems,Transportation and Logistics,"Cudahy, WI",1995,48,4502
Wholesalers,991,BlueLinx Holdings,Wholesalers: Diversified,"Atlanta, GA",1917,-12,1600

In [204]:
# max profit -> energy sector
df_fort[df_fort['Sector'] == 'Energy']['Profits'].max()

16150

In [216]:
df_fort[df_fort['Sector'] == 'Energy']['Profits'].sort_values(ascending=False).iloc[0]

16150

In [218]:
df_fort.groupby('Sector').get_group('Energy')['Profits'].max()

16150

In [219]:
df_fort.groupby('Sector').min()

,Rank,Company,Industry,Location,Revenue,Profits,Employees
Sector,,,,,,,
Aerospace & Defense,24,B/E Aerospace,Aerospace and Defense,"Berwyn, PA",1923,-240,6955
Apparel,91,Carterâ€™s,Apparel,"Atlanta, GA",2204,82,5978
Business Services,144,ABM Industries,"Advertising, marketing","Arlington, VA",1910,-1481,2400
Chemicals,56,A. Schulman,Chemicals,"Allentown, PA",2084,-816,1979
Energy,2,AES,Energy,"Akron, OH",1898,-23119,480
Engineering & Construction,155,AECOM,"Engineering, Construction","Atlanta, GA",1909,-155,1036
Financials,4,AIG,Commercial Banks,"Atlanta, GA",1902,-1194,187
Food and Drug Stores,7,CVS Health,Food and Drug Stores,"Austin, TX",2151,-62,1616
"Food, Beverages & Tobacco",41,Alliance One International,Beverages,"Arden Hills, MN",2066,-253,1857
Health Care,5,AbbVie,Health Care: Insurance and Managed Care,"Abbott Park, IL",1987,-458,2924
"Hotels, Resturants & Leisure",109,Bloominâ€™ Brands,Food Services,"Ann Arbor, MI",1896,-1394,8500
Household Products,34,Avon Products,"Home Equipment, Furnishings","Atlanta, GA",1914,-1149,4406
Industrials,11,3M,Construction and Farm Machinery,"Annapolis Junction, MD",1895,-6126,4104
Materials,126,A-Mark Precious Metals,"Building Materials, Glass","Atlanta, GA",1924,-1642,52
Media,53,AMC Networks,Entertainment,"Beverly Hills, CA",1921,-881,2341
Motor Vehicles & Parts,8,Allison Transmission Holdings,Motor Vehicles and Parts,"Akron, OH",1986,-889,2700
Retailing,1,99 Cents Only Stores,"Automotive Retailing, Services","Ankeny, IA",1999,-1243,2155
Technology,3,Activision Blizzard,Computer Peripherals,"Angleton, TX",1920,-4359,2285
Telecommunications,10,AT&T,Telecommunications,"Bethpage, NY",2726,-271,2700
Transportation,48,Alaska Air Group,Airlines,"Atlanta, GA",1995,-191,1223
Wholesalers,57,Airgas,Miscellaneous,"Atlanta, GA",1917,-502,500

In [234]:
df_fort.groupby('Sector')['Profits'].max()

Sector
Aerospace & Defense              7608
Apparel                          3273
Business Services                6328
Chemicals                        7685
Energy                          16150
Engineering & Construction        803
Financials                      24442
Food and Drug Stores             5237
Food, Beverages & Tobacco        7351
Health Care                     18108
Hotels, Resturants & Leisure     5920
Household Products               7036
Industrials                      4833
Materials                         991
Media                            8382
Motor Vehicles & Parts           9687
Retailing                       14694
Technology                      53394
Telecommunications              17879
Transportation                   7610
Wholesalers                      1472
Name: Profits, dtype: int64

In [232]:
# avg emp for ad and marketing industry

df_fort[df_fort['Industry'] == 'Advertising, marketing']['Employees'].mean()

62050.0

In [245]:
temp_fort = df_fort.groupby(['Sector','Industry'])#.get_group(('Energy','Petroleum Refining'))

In [246]:
temp_fort.get_group(('Energy','Petroleum Refining'))

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
13,14,Chevron,Energy,Petroleum Refining,"San Ramon, CA",131118,4587,61500
29,30,Phillips 66,Energy,Petroleum Refining,"Houston, TX",87169,4227,14000
31,32,Valero Energy,Energy,Petroleum Refining,"San Antonio, TX",81824,3990,10103
41,42,Marathon Petroleum,Energy,Petroleum Refining,"Findlay, OH",64566,2852,45440
97,98,Tesoro,Energy,Petroleum Refining,"San Antonio, TX",28150,1540,6016
213,214,HollyFrontier,Energy,Petroleum Refining,"Dallas, TX",13238,740,2704
216,217,PBF Energy,Energy,Petroleum Refining,"Parsippany, NJ",13124,146,2270
288,289,Western Refining,Energy,Petroleum Refining,"El Paso, TX",9787,407,7347
393,394,Hess,Energy,Petroleum Refining,"New York, NY",6575,-3056,2770
444,445,Delek US Holdings,Energy,Petroleum Refining,"Brentwood, TN",5762,19,4584
568,569,Alon USA Energy,Energy,Petroleum Refining,"Dallas, TX",4260,53,2860
570,571,Calumet Specialty Products Partners,Energy,Petroleum Refining,"Indianapolis, IN",4213,-139,2175
731,732,Northern Tier Energy,Energy,Petroleum Refining,"Tempe, AZ",3002,331,2961
849,850,United Refining,Energy,Petroleum Refining,"Warren, PA",2470,82,2997
952,953,Par Pacific Holdings,Energy,Petroleum Refining,"Houston, TX",2066,-40,744
982,983,Adams Resources & Energy,Energy,Petroleum Refining,"Houston, TX",1944,-1,809

In [248]:
df_fort.groupby('Sector').agg({'Profits':max,'Employees':min})

                              Profits  Employees
Sector
Aerospace & Defense              7608       6955
Apparel                          3273       5978
Business Services                6328       2400
Chemicals                        7685       1979
Energy                          16150        480
Engineering & Construction        803       1036
Financials                      24442        187
Food and Drug Stores             5237       1616
Food, Beverages & Tobacco        7351       1857
Health Care                     18108       2924
Hotels, Resturants & Leisure     5920       8500
Household Products               7036       4406
Industrials                      4833       4104
Materials                         991         52
Media                            8382       2341
Motor Vehicles & Parts           9687       2700
Retailing                       14694       2155
Technology                      53394       2285
Telecommunications              17879       2700
Transportation                   7610       1223
Wholesalers                      1472        500

In [250]:
df_fort2 = pd.read_csv('DataSets/fortune_data.csv')
df_fort2.head()

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400

In [251]:
pd.concat([df_fort2,df_fort],ignore_index=True)

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
...,...,...,...,...,...,...,...,...
1995,996,New York Community Bancorp,Financials,Commercial Banks,"Westbury, NY",1902,-47,3448
1996,997,Portland General Electric,Energy,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
1997,997,Portland General Electric,Energy,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
1998,999,Wendyâ€™s,"Hotels, Resturants & Leisure",Food Services,"Dublin, OH",1896,161,21200
1999,1000,Briggs & Stratton,Industrials,Industrial Machinery,"Wauwatosa, WI",1895,46,5480

In [254]:
df_fort.merge(df_fort2,)

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
...,...,...,...,...,...,...,...,...
1003,997,Portland General Electric,Energy,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
1004,997,Portland General Electric,Energy,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
1005,997,Portland General Electric,Energy,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
1006,999,Wendyâ€™s,"Hotels, Resturants & Leisure",Food Services,"Dublin, OH",1896,161,21200
1007,1000,Briggs & Stratton,Industrials,Industrial Machinery,"Wauwatosa, WI",1895,46,5480

In [256]:
df_fort.append(df_fort2)

C:\Users\miles.MILE-BL-4766-LA.000\AppData\Local\Temp\ipykernel_4136\1729111210.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_fort.append(df_fort2)

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
...,...,...,...,...,...,...,...,...
995,996,New York Community Bancorp,Financials,Commercial Banks,"Westbury, NY",1902,-47,3448
996,997,Portland General Electric,Energy,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
997,997,Portland General Electric,Energy,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
998,999,Wendyâ€™s,"Hotels, Resturants & Leisure",Food Services,"Dublin, OH",1896,161,21200
999,1000,Briggs & Stratton,Industrials,Industrial Machinery,"Wauwatosa, WI",1895,46,5480

In [257]:
df_movie = pd.read_csv('DataSets/movies.csv')
df_movie

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [260]:
df_rating = pd.read_csv('DataSets/ratings.csv')
df_rating

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [259]:
df_movie.merge(df_rating)

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483
...,...,...,...,...,...,...
100831,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,184,4.0,1537109082
100832,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,184,3.5,1537109545
100833,193585,Flint (2017),Drama,184,3.5,1537109805
100834,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,184,3.5,1537110021
100835,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,331,4.0,1537157606

In [265]:
df_movie.merge(df_rating)[['movieId','userId','title']]

        movieId  userId                                      title
0             1       1                           Toy Story (1995)
1             1       5                           Toy Story (1995)
2             1       7                           Toy Story (1995)
3             1      15                           Toy Story (1995)
4             1      17                           Toy Story (1995)
...         ...     ...                                        ...
100831   193581     184  Black Butler: Book of the Atlantic (2017)
100832   193583     184               No Game No Life: Zero (2017)
100833   193585     184                               Flint (2017)
100834   193587     184        Bungo Stray Dogs: Dead Apple (2018)
100835   193609     331        Andrew Dice Clay: Dice Rules (1991)

[100836 rows x 3 columns]

In [268]:
df_movie = df_movie.rename(columns={'movieId':'movie_id'})

In [269]:
df_tags = pd.read_csv('DataSets/tags.csv')
df_tags

      userId  movieId               tag   timestamp
0          2    60756             funny  1445714994
1          2    60756   Highly quotable  1445714996
2          2    60756      will ferrell  1445714992
3          2    89774      Boxing story  1445715207
4          2    89774               MMA  1445715200
...      ...      ...               ...         ...
3678     606     7382         for katie  1171234019
3679     606     7936           austere  1173392334
3680     610     3265            gun fu  1493843984
3681     610     3265  heroic bloodshed  1493843978
3682     610   168248  Heroic Bloodshed  1493844270

[3683 rows x 4 columns]

In [284]:
df_movie.merge(df_rating,left_on='movie_id',right_on='movieId').merge(df_tags,left_on=['movie_id','userId'],right_on=['movieId','userId'])[['movie_id','title','tag','userId']].sort_values('userId')

,movie_id,title,tag,userId
3160,106782,"Wolf of Wall Street, The (2013)",Leonardo DiCaprio,2
3161,106782,"Wolf of Wall Street, The (2013)",Martin Scorsese,2
2769,60756,Step Brothers (2008),will ferrell,2
3159,106782,"Wolf of Wall Street, The (2013)",drugs,2
2768,60756,Step Brothers (2008),Highly quotable,2
...,...,...,...,...
1565,3578,Gladiator (2000),Romans,606
2281,7382,I'm Not Scared (Io non ho paura) (2003),for katie,606
3427,168248,John Wick: Chapter Two (2017),Heroic Bloodshed,610
1476,3265,Hard-Boiled (Lat sau san taam) (1992),gun fu,610
1477,3265,Hard-Boiled (Lat sau san taam) (1992),heroic bloodshed,610

In [279]:
df_tags['userId'].nunique(),df_tags['movieId'].nunique()

(58, 1572)

In [280]:
df_rating['userId'].nunique(),df_rating['movieId'].nunique()

(610, 9724)

In [283]:
df_tags['movieId'].isin(df_rating['movieId'].unique()).sum()

3662

In [285]:
df_rating.merge(df_tags,left_on=['movieId','userId'],right_on=['movieId','userId'])[['movieId','tag','userId']].sort_values('userId')

      movieId                tag  userId
0       60756              funny       2
7      106782  Leonardo DiCaprio       2
6      106782              drugs       2
5       89774          Tom Hardy       2
8      106782    Martin Scorsese       2
...       ...                ...     ...
3471     6107       World War II     606
3472     7382          for katie     606
3474     3265   heroic bloodshed     610
3473     3265             gun fu     610
3475   168248   Heroic Bloodshed     610

[3476 rows x 3 columns]

In [298]:
df_rating.merge(df_tags,left_on=['movieId','userId'],right_on=['movieId','userId'],how='inner',indicator=True)

,userId,movieId,rating,timestamp_x,tag,timestamp_y,_merge
0,2,60756,5.0,1445714980,funny,1445714994,both
1,2,60756,5.0,1445714980,Highly quotable,1445714996,both
2,2,60756,5.0,1445714980,will ferrell,1445714992,both
3,2,89774,5.0,1445715189,Boxing story,1445715207,both
4,2,89774,5.0,1445715189,MMA,1445715200,both
...,...,...,...,...,...,...,...
3471,606,6107,4.0,1171324428,World War II,1178473747,both
3472,606,7382,4.5,1171233924,for katie,1171234019,both
3473,610,3265,5.0,1479542010,gun fu,1493843984,both
3474,610,3265,5.0,1479542010,heroic bloodshed,1493843978,both
3475,610,168248,5.0,1493850091,Heroic Bloodshed,1493844270,both

In [296]:
df_rating.merge(df_tags,left_on=['movieId','userId'],right_on=['movieId','userId'],how='left',indicator=True)

,userId,movieId,rating,timestamp_x,tag,timestamp_y,_merge
0,1,1,4.0,964982703,NaN,NaN,left_only
1,1,3,4.0,964981247,NaN,NaN,left_only
2,1,6,4.0,964982224,NaN,NaN,left_only
3,1,47,5.0,964983815,NaN,NaN,left_only
4,1,50,5.0,964982931,NaN,NaN,left_only
...,...,...,...,...,...,...,...
102672,610,166534,4.0,1493848402,NaN,NaN,left_only
102673,610,168248,5.0,1493850091,Heroic Bloodshed,1.493844e+09,both
102674,610,168250,5.0,1494273047,NaN,NaN,left_only
102675,610,168252,5.0,1493846352,NaN,NaN,left_only
102676,610,170875,3.0,1493846415,NaN,NaN,left_only

In [294]:
df_rating.merge(df_tags,left_on=['movieId','userId'],right_on=['movieId','userId'],how='right',indicator=True)

,userId,movieId,rating,timestamp_x,tag,timestamp_y,_merge
0,2,60756,5.0,1.445715e+09,funny,1445714994,both
1,2,60756,5.0,1.445715e+09,Highly quotable,1445714996,both
2,2,60756,5.0,1.445715e+09,will ferrell,1445714992,both
3,2,89774,5.0,1.445715e+09,Boxing story,1445715207,both
4,2,89774,5.0,1.445715e+09,MMA,1445715200,both
...,...,...,...,...,...,...,...
3678,606,7382,4.5,1.171234e+09,for katie,1171234019,both
3679,606,7936,NaN,NaN,austere,1173392334,right_only
3680,610,3265,5.0,1.479542e+09,gun fu,1493843984,both
3681,610,3265,5.0,1.479542e+09,heroic bloodshed,1493843978,both
3682,610,168248,5.0,1.493850e+09,Heroic Bloodshed,1493844270,both

In [299]:
df_rating.merge(df_tags,left_on=['movieId','userId'],right_on=['movieId','userId'],how='outer',indicator=True,suffixes=['_ratng','_tags'])

,userId,movieId,rating,timestamp_ratng,tag,timestamp_tags,_merge
0,1,1,4.0,964982703.0,NaN,NaN,left_only
1,1,3,4.0,964981247.0,NaN,NaN,left_only
2,1,6,4.0,964982224.0,NaN,NaN,left_only
3,1,47,5.0,964983815.0,NaN,NaN,left_only
4,1,50,5.0,964982931.0,NaN,NaN,left_only
...,...,...,...,...,...,...,...
102879,573,6016,NaN,NaN,not seen,1.186589e+09,right_only
102880,573,6157,NaN,NaN,bad,1.186589e+09,right_only
102881,573,6157,NaN,NaN,Ben Affleck,1.186589e+09,right_only
102882,600,273,NaN,NaN,gothic,1.237739e+09,right_only
102883,606,7936,NaN,NaN,austere,1.173392e+09,right_only

In [300]:
# time series

In [301]:
import datetime as dt

In [303]:
dt.datetime(1998,6,9)

datetime.datetime(1998, 6, 9, 0, 0)

In [309]:
pd.Timestamp('2013-1-3')

Timestamp('2013-01-03 00:00:00')

In [312]:
dt.datetime.now()

datetime.datetime(2023, 2, 2, 17, 7, 36, 685934)

In [314]:
pd.date_range(start='2023-02-1', end='2023-02-20',freq='D')

DatetimeIndex(['2023-02-01', '2023-02-02', '2023-02-03', '2023-02-04',
               '2023-02-05', '2023-02-06', '2023-02-07', '2023-02-08',
               '2023-02-09', '2023-02-10', '2023-02-11', '2023-02-12',
               '2023-02-13', '2023-02-14', '2023-02-15', '2023-02-16',
               '2023-02-17', '2023-02-18', '2023-02-19', '2023-02-20'],
              dtype='datetime64[ns]', freq='D')

In [315]:
pd.date_range(start='2023-02-1', end='2023-02-20',freq='B')

DatetimeIndex(['2023-02-01', '2023-02-02', '2023-02-03', '2023-02-06',
               '2023-02-07', '2023-02-08', '2023-02-09', '2023-02-10',
               '2023-02-13', '2023-02-14', '2023-02-15', '2023-02-16',
               '2023-02-17', '2023-02-20'],
              dtype='datetime64[ns]', freq='B')

In [316]:
pd.date_range(start='2023-02-1', end='2023-02-20',freq='W')

DatetimeIndex(['2023-02-05', '2023-02-12', '2023-02-19'], dtype='datetime64[ns]', freq='W-SUN')

In [321]:
timeseries = pd.Series(pd.date_range(start='2023-02-1', end='2023-02-20',freq='D'))

In [323]:
timeseries.dt.day_name()

0     Wednesday
1      Thursday
2        Friday
3      Saturday
4        Sunday
5        Monday
6       Tuesday
7     Wednesday
8      Thursday
9        Friday
10     Saturday
11       Sunday
12       Monday
13      Tuesday
14    Wednesday
15     Thursday
16       Friday
17     Saturday
18       Sunday
19       Monday
dtype: object

In [324]:
! pip install pandas-datareader

Collecting pandas-datareader
  Downloading pandas_datareader-0.10.0-py3-none-any.whl (109 kB)
     ------------------------------------ 109.5/109.5 kB 576.9 kB/s eta 0:00:00
Requirement already satisfied: requests>=2.19.0 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from pandas-datareader) (2.28.1)
Requirement already satisfied: pandas>=0.23 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from pandas-datareader) (1.4.4)
Requirement already satisfied: lxml in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from pandas-datareader) (4.9.1)
Requirement already satisfied: pytz>=2020.1 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (1.21.5)
Requirement already satisfied: charset-normalizer<3,>=2 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (3.3)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (1.26.11)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2022.9.14)
Requirement already satisfied: six>=1.5 in c:\users\miles.mile-bl-4766-la.000\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas>=0.23->pandas-datareader) (1.16.0)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.10.0

In [326]:
import pandas_datareader as data

In [347]:
df_msft = data.DataReader(name='MSFT', data_source='stooq', start='2020-01-01', end='2023-01-01')

In [348]:
type(df_msft)

pandas.core.frame.DataFrame

In [349]:
df_msft.head()

              Open    High       Low   Close      Volume
Date
2022-12-30  238.21  239.96  236.6600  239.82  21938472.0
2022-12-29  235.65  241.92  235.6500  241.01  19770693.0
2022-12-28  236.89  239.72  234.1700  234.53  17457104.0
2022-12-27  238.70  238.93  235.8300  236.96  16688648.0
2022-12-23  236.11  238.87  233.9428  238.73  21206982.0

In [333]:

df_msft['Date'] = df_msft.index

In [342]:
# total shares trade from mon to wed 
# hight val of stock placed in each year
# min closing val of each quarter in 2022

df_msft['Day'] = df_msft['Date'].dt.day_name()

In [346]:
# 1
df_msft.groupby('Day')['Volume'].sum()

Day
Friday       1.631299e+09
Monday       1.379890e+09
Thursday     1.614756e+09
Tuesday      1.589673e+09
Wednesday    1.663333e+09
Name: Volume, dtype: float64

In [ ]:
# 2
df_msft.